In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("../Dataset/metflix.csv")
df

      ids  ages  bookmarks  replies  ratings  watches period
0     912    47          5       11       23       74    16M
1     325    44          6        4       11       90    10M
2     282    49          6       12       38      188    10M
3    1234    21         13       53       89      766    21M
4    1279    25         40       73      186      736    22M
..    ...   ...        ...      ...      ...      ...    ...
535   572    43          5        7       13      141    10M
536  1572    53          5       13       15      131    27M
537   634    27         15      117      403      676    11M
538   257    24         30       99      266      578    10M
539  2154    22         30       83      105      899    36M

[540 rows x 7 columns]

In [3]:
df.dtypes

ids           int64
ages          int64
bookmarks     int64
replies       int64
ratings       int64
watches       int64
period       object
dtype: object

In [17]:
test = '123M'
print(test.replace('M', ''))

123

In [8]:
print((df['period'][0])[:-1])

16

In [16]:
df_sub1 = df.copy()
df_sub1

      ids  ages  bookmarks  replies  ratings  watches period
0     912    47          5       11       23       74    16M
1     325    44          6        4       11       90    10M
2     282    49          6       12       38      188    10M
3    1234    21         13       53       89      766    21M
4    1279    25         40       73      186      736    22M
..    ...   ...        ...      ...      ...      ...    ...
535   572    43          5        7       13      141    10M
536  1572    53          5       13       15      131    27M
537   634    27         15      117      403      676    11M
538   257    24         30       99      266      578    10M
539  2154    22         30       83      105      899    36M

[540 rows x 7 columns]

In [18]:
df_sub1['period'] = df_sub1['period'].str.replace('M', '')
df_sub1

      ids  ages  bookmarks  replies  ratings  watches period
0     912    47          5       11       23       74     16
1     325    44          6        4       11       90     10
2     282    49          6       12       38      188     10
3    1234    21         13       53       89      766     21
4    1279    25         40       73      186      736     22
..    ...   ...        ...      ...      ...      ...    ...
535   572    43          5        7       13      141     10
536  1572    53          5       13       15      131     27
537   634    27         15      117      403      676     11
538   257    24         30       99      266      578     10
539  2154    22         30       83      105      899     36

[540 rows x 7 columns]

In [23]:
df_sub1['period'] = df_sub1['period'].astype(int)
df_sub1.dtypes

ids          int64
ages         int64
bookmarks    int64
replies      int64
ratings      int64
watches      int64
period       int32
dtype: object

In [24]:
customer = df_sub1

In [25]:
customer

      ids  ages  bookmarks  replies  ratings  watches  period
0     912    47          5       11       23       74      16
1     325    44          6        4       11       90      10
2     282    49          6       12       38      188      10
3    1234    21         13       53       89      766      21
4    1279    25         40       73      186      736      22
..    ...   ...        ...      ...      ...      ...     ...
535   572    43          5        7       13      141      10
536  1572    53          5       13       15      131      27
537   634    27         15      117      403      676      11
538   257    24         30       99      266      578      10
539  2154    22         30       83      105      899      36

[540 rows x 7 columns]

In [26]:
Q3 = customer['ratings'].quantile(q=0.75)
Q3

215.25

In [27]:
Q1 = customer['ratings'].quantile(q=0.25)
Q1

24.75

In [28]:
IQR = Q3-Q1
IQR

190.5

In [92]:
Median = customer['ratings'].median()
############여기서 mean이 아니라 median으로 구햇어야함
Median

99.5

In [94]:
lower = (Median - 2.3*IQR)
upper = (Median + 2.3*IQR)
print(lower, upper)

-338.65 537.65

In [95]:
customer.loc[customer['ratings']>upper]

      ids  ages  bookmarks  replies  ratings  watches  period
58   1132    36         16       94     1251      739      20
111   464    20         30       85     1509      648      10
159   228    41          2        4      568       53      10
184  1114    33         32      133      559      250      19
215  1603    26         49       35      911      362      28
219  1892    33         11      138      538       43      33
223   241    28         43      149      552      305      10
234  1628    28         42       60     1000      141      29
263    91    19         35       53     1027      925      10
312  1984    33          0      141      549      644      34
339  2054    39         21       93      625      529      35
355   108    42          1        4      541      182      10
375   479    25         42       10     1680      719      10
400   923    31         12      140      547      773      16
472  2148    35         11      146      553      670      36
510   364    19          9      115     1506      555      10

In [96]:
print(customer['ratings'].min())

0

In [97]:
customer_sub1 = customer.loc[customer['ratings']<=upper]
customer_sub1

      ids  ages  bookmarks  replies  ratings  watches  period
0     912    47          5       11       23       74      16
1     325    44          6        4       11       90      10
2     282    49          6       12       38      188      10
3    1234    21         13       53       89      766      21
4    1279    25         40       73      186      736      22
..    ...   ...        ...      ...      ...      ...     ...
535   572    43          5        7       13      141      10
536  1572    53          5       13       15      131      27
537   634    27         15      117      403      676      11
538   257    24         30       99      266      578      10
539  2154    22         30       83      105      899      36

[524 rows x 7 columns]

In [98]:
answer = customer_sub1['ratings'].mean()
answer

126.76717557251908

In [99]:
answer = round(answer, 2)
print(answer)

126.77

In [38]:
customer

      ids  ages  bookmarks  replies  ratings  watches  period
0     912    47          5       11       23       74      16
1     325    44          6        4       11       90      10
2     282    49          6       12       38      188      10
3    1234    21         13       53       89      766      21
4    1279    25         40       73      186      736      22
..    ...   ...        ...      ...      ...      ...     ...
535   572    43          5        7       13      141      10
536  1572    53          5       13       15      131      27
537   634    27         15      117      403      676      11
538   257    24         30       99      266      578      10
539  2154    22         30       83      105      899      36

[540 rows x 7 columns]

In [39]:
customer_sub2 = customer.copy()

In [40]:
customer_sub2['age_cls'] = 0
customer_sub2

      ids  ages  bookmarks  replies  ratings  watches  period  age_cls
0     912    47          5       11       23       74      16        0
1     325    44          6        4       11       90      10        0
2     282    49          6       12       38      188      10        0
3    1234    21         13       53       89      766      21        0
4    1279    25         40       73      186      736      22        0
..    ...   ...        ...      ...      ...      ...     ...      ...
535   572    43          5        7       13      141      10        0
536  1572    53          5       13       15      131      27        0
537   634    27         15      117      403      676      11        0
538   257    24         30       99      266      578      10        0
539  2154    22         30       83      105      899      36        0

[540 rows x 8 columns]

In [42]:
customer_sub2['age_cls'] = customer_sub2['ages']//10
customer_sub2

      ids  ages  bookmarks  replies  ratings  watches  period  age_cls
0     912    47          5       11       23       74      16        4
1     325    44          6        4       11       90      10        4
2     282    49          6       12       38      188      10        4
3    1234    21         13       53       89      766      21        2
4    1279    25         40       73      186      736      22        2
..    ...   ...        ...      ...      ...      ...     ...      ...
535   572    43          5        7       13      141      10        4
536  1572    53          5       13       15      131      27        5
537   634    27         15      117      403      676      11        2
538   257    24         30       99      266      578      10        2
539  2154    22         30       83      105      899      36        2

[540 rows x 8 columns]

In [44]:
customer_sub2.groupby(['age_cls']).count()

         ids  ages  bookmarks  replies  ratings  watches  period
age_cls
1         37    37         37       37       37       37      37
2        186   186        186      186      186      186     186
3        179   179        179      179      179      179     179
4        114   114        114      114      114      114     114
5         24    24         24       24       24       24      24

In [46]:
customer_sub2.groupby(['age_cls'])['replies'].mean().sort_values()

age_cls
4     6.482456
5     7.416667
1    68.135135
2    69.344086
3    75.804469
Name: replies, dtype: float64

In [47]:
A = 75.804469
B = 6.482456
answer = A+B
answer = round(answer, 2)

In [48]:
answer

82.29

In [49]:
customer_sub2

      ids  ages  bookmarks  replies  ratings  watches  period  age_cls
0     912    47          5       11       23       74      16        4
1     325    44          6        4       11       90      10        4
2     282    49          6       12       38      188      10        4
3    1234    21         13       53       89      766      21        2
4    1279    25         40       73      186      736      22        2
..    ...   ...        ...      ...      ...      ...     ...      ...
535   572    43          5        7       13      141      10        4
536  1572    53          5       13       15      131      27        5
537   634    27         15      117      403      676      11        2
538   257    24         30       99      266      578      10        2
539  2154    22         30       83      105      899      36        2

[540 rows x 8 columns]

In [54]:
customer_sub3 = customer_sub2.copy()
np.where(customer_sub3['age_cls']>=4, 1, 0)
customer_sub3['age_cls'] = np.where(customer_sub3['age_cls']>=4, 1, 0)
customer_sub3

      ids  ages  bookmarks  replies  ratings  watches  period  age_cls
0     912    47          5       11       23       74      16        1
1     325    44          6        4       11       90      10        1
2     282    49          6       12       38      188      10        1
3    1234    21         13       53       89      766      21        0
4    1279    25         40       73      186      736      22        0
..    ...   ...        ...      ...      ...      ...     ...      ...
535   572    43          5        7       13      141      10        1
536  1572    53          5       13       15      131      27        1
537   634    27         15      117      403      676      11        0
538   257    24         30       99      266      578      10        0
539  2154    22         30       83      105      899      36        0

[540 rows x 8 columns]

In [55]:
customer_sub3.dtypes

ids          int64
ages         int64
bookmarks    int64
replies      int64
ratings      int64
watches      int64
period       int32
age_cls      int32
dtype: object

In [56]:
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
random_state = 229

In [57]:
#단계 2 : Train Set과 Test Set을 99:1 비율로 나눈다.

In [60]:
train_set, test_set = train_test_split(customer_sub3, train_size=0.99, random_state=random_state)
train_set

      ids  ages  bookmarks  replies  ratings  watches  period  age_cls
336   195    48          2        7       20      190      10        1
278  1334    24         15        0        0      647      23        0
149   500    49          0        4        6       84      10        1
241  2130    23         46      102      103      716      36        0
413  2140    42          2        1        3       80      36        1
..    ...   ...        ...      ...      ...      ...     ...      ...
50    182    37          6       81      234      841      10        0
501   406    24         26       71       81      309      10        0
112   360    42          5       11       36      181      10        1
476   621    33          6      139      388       53      11        0
345  1475    38         19       40       71      353      10        0

[534 rows x 8 columns]

In [61]:
train_set.groupby(['replies']).count()

         ids  ages  bookmarks  ratings  watches  period  age_cls
replies
0         13    13         13       13       13      13       13
1         13    13         13       13       13      13       13
2         10    10         10       10       10      10       10
3         12    12         12       12       12      12       12
4         16    16         16       16       16      16       16
...      ...   ...        ...      ...      ...     ...      ...
144        1     1          1        1        1       1        1
146        4     4          4        4        4       4        4
147        1     1          1        1        1       1        1
148        2     2          2        2        2       2        2
149        5     5          5        5        5       5        5

[142 rows x 7 columns]

In [62]:
test_set.groupby(['replies']).count()

         ids  ages  bookmarks  ratings  watches  period  age_cls
replies
8          1     1          1        1        1       1        1
22         1     1          1        1        1       1        1
41         1     1          1        1        1       1        1
68         1     1          1        1        1       1        1
91         1     1          1        1        1       1        1
94         1     1          1        1        1       1        1

In [66]:
customer_sub3['X1'] = customer_sub3['period']/(customer_sub3['replies']+0.01)
customer_sub3

,ids,ages,bookmarks,replies,ratings,watches,period,age_cls,X1
0,912,47,5,11,23,74,16,1,1.453224
1,325,44,6,4,11,90,10,1,2.493766
2,282,49,6,12,38,188,10,1,0.832639
3,1234,21,13,53,89,766,21,0,0.396152
4,1279,25,40,73,186,736,22,0,0.301329
...,...,...,...,...,...,...,...,...,...
535,572,43,5,7,13,141,10,1,1.426534
536,1572,53,5,13,15,131,27,1,2.075327
537,634,27,15,117,403,676,11,0,0.094009
538,257,24,30,99,266,578,10,0,0.101000
539,2154,22,30,83,105,899,36,0,0.433683

In [70]:
train_set, test_set = train_test_split(customer_sub3, train_size=0.99, random_state=random_state)
train_set
X1 = train_set[['X1']]
X1

              X1
336     1.426534
278  2300.000000
149     2.493766
241     0.352907
413    35.643564
..           ...
50      0.123442
501     0.140825
112     0.908265
476     0.079131
345     0.249938

[534 rows x 1 columns]

In [100]:
y = train_set['age_cls']
model1 = KNeighborsClassifier(p=1, weights='distance').fit(X1, y)
#KNeighborsClassifier의 거리는 Manhattan Distance 사용, 
#가중치는 거리 역순으로 설정
#문제 조건을 잘 봐야함!!!!!!!!!!

In [73]:
train_set

,ids,ages,bookmarks,replies,ratings,watches,period,age_cls,X1
336,195,48,2,7,20,190,10,1,1.426534
278,1334,24,15,0,0,647,23,0,2300.000000
149,500,49,0,4,6,84,10,1,2.493766
241,2130,23,46,102,103,716,36,0,0.352907
413,2140,42,2,1,3,80,36,1,35.643564
...,...,...,...,...,...,...,...,...,...
50,182,37,6,81,234,841,10,0,0.123442
501,406,24,26,71,81,309,10,0,0.140825
112,360,42,5,11,36,181,10,1,0.908265
476,621,33,6,139,388,53,11,0,0.079131
345,1475,38,19,40,71,353,10,0,0.249938

In [74]:
train_set2 = train_set.copy()

In [76]:
train_set2 = train_set2.loc[train_set2['replies']>0]
train_set2

,ids,ages,bookmarks,replies,ratings,watches,period,age_cls,X1
336,195,48,2,7,20,190,10,1,1.426534
149,500,49,0,4,6,84,10,1,2.493766
241,2130,23,46,102,103,716,36,0,0.352907
413,2140,42,2,1,3,80,36,1,35.643564
109,341,18,17,52,187,331,10,0,0.192271
...,...,...,...,...,...,...,...,...,...
50,182,37,6,81,234,841,10,0,0.123442
501,406,24,26,71,81,309,10,0,0.140825
112,360,42,5,11,36,181,10,1,0.908265
476,621,33,6,139,388,53,11,0,0.079131
345,1475,38,19,40,71,353,10,0,0.249938

In [77]:
train_set2['X2'] = train_set2['period']/train_set2['replies']
train_set2

C:\Users\syoun\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

,ids,ages,bookmarks,replies,ratings,watches,period,age_cls,X1,X2
336,195,48,2,7,20,190,10,1,1.426534,1.428571
149,500,49,0,4,6,84,10,1,2.493766,2.500000
241,2130,23,46,102,103,716,36,0,0.352907,0.352941
413,2140,42,2,1,3,80,36,1,35.643564,36.000000
109,341,18,17,52,187,331,10,0,0.192271,0.192308
...,...,...,...,...,...,...,...,...,...,...
50,182,37,6,81,234,841,10,0,0.123442,0.123457
501,406,24,26,71,81,309,10,0,0.140825,0.140845
112,360,42,5,11,36,181,10,1,0.908265,0.909091
476,621,33,6,139,388,53,11,0,0.079131,0.079137
345,1475,38,19,40,71,353,10,0,0.249938,0.250000

In [101]:
X2 = train_set2[['X2']]
y2 = train_set2['age_cls']
model2 = KNeighborsClassifier(p=2, weights='distance').fit(X2, y2)

In [79]:
test_set

,ids,ages,bookmarks,replies,ratings,watches,period,age_cls,X1
503,2145,37,34,41,50,123,36,0,0.877835
397,95,26,19,94,161,782,10,0,0.106372
524,1241,35,20,22,70,831,21,0,0.954112
32,635,24,49,68,187,430,12,0,0.176445
341,855,21,26,91,303,456,15,0,0.164817
225,513,52,0,8,29,74,10,1,1.248439

In [80]:
test_set['X2'] = test_set['period']/test_set['replies']

C:\Users\syoun\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [81]:
test_set

,ids,ages,bookmarks,replies,ratings,watches,period,age_cls,X1,X2
503,2145,37,34,41,50,123,36,0,0.877835,0.878049
397,95,26,19,94,161,782,10,0,0.106372,0.106383
524,1241,35,20,22,70,831,21,0,0.954112,0.954545
32,635,24,49,68,187,430,12,0,0.176445,0.176471
341,855,21,26,91,303,456,15,0,0.164817,0.164835
225,513,52,0,8,29,74,10,1,1.248439,1.250000

In [102]:
pred_1=model1.predict(test_set[['X1']])

In [103]:
pred_1

array([0, 0, 0, 0, 0, 1])

In [104]:
pred_2=model2.predict(test_set[['X2']])
pred_2

array([0, 0, 0, 0, 0, 1])

In [105]:
test_y = test_set['age_cls']
test_y.to_list()

[0, 0, 0, 0, 0, 1]

In [106]:
A1 = 5
B1 = 0
A2 = 5
B2 = 0
P1 = A1/(A1+B1)
P2 = A2/(A2+B2)
print(P1, P2)

1.0 1.0

In [107]:
answer = max(P1, P2)

In [108]:
answer = round(answer, 2)
answer

1.0